In [1]:
# Import packages

import numpy as np
import pandas as pd
import scipy.stats as stats
import statsmodels.stats.api as sms

In [11]:
# Upload the groups and activity csv files

activity=pd.read_csv('/Users/aktolkynperritaz/Documents/Masterschool_Data Analyst/Mastery project/GloBox_DF/activity.csv')
groups=pd.read_csv('/Users/aktolkynperritaz/Documents/Masterschool_Data Analyst/Mastery project/GloBox_DF/groups_query_results.csv')
users=pd.read_csv('/Users/aktolkynperritaz/Documents/Masterschool_Data Analyst/Mastery project/GloBox_DF/users.csv')

In [ ]:
# Perform a quick overview of the upaloaded csv files

In [4]:
activity.head()

       uid          dt device      spent
0  1000039  2023-02-04      A  36.650000
1  1000045  2023-01-30      I  51.580000
2  1000071  2023-02-02      I   6.710000
3  1000101  2023-02-02      A  18.130000
4  1000101  2023-02-05      A   5.674497

In [5]:
activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2233 entries, 0 to 2232
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   uid     2233 non-null   int64
 1   dt      2233 non-null   object
 2   device  2223 non-null   object
 3   spent   2233 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 69.9+ KB

In [6]:
activity.shape

(2233, 4)

In [7]:
groups.head()

       uid group     join_dt device
0  1000000     B  2023-01-28      I
1  1000001     A  2023-01-27      A
2  1000002     A  2023-02-01      A
3  1000003     B  2023-01-25      I
4  1000004     A  2023-02-04      A

In [8]:
groups.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48943 entries, 0 to 48942
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   uid      48943 non-null  int64
 1   group    48943 non-null  object
 2   join_dt  48943 non-null  object
 3   device   48649 non-null  object
dtypes: int64(1), object(3)
memory usage: 1.5+ MB

In [10]:
groups.shape

(48943, 4)

In [12]:
users.head()

        id country gender
0  1000000     CAN      M
1  1000001     BRA      M
2  1000002     FRA      M
3  1000003     BRA      M
4  1000004     DEU      F

In [13]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48943 entries, 0 to 48942
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       48943 non-null  int64
 1   country  48300 non-null  object
 2   gender   42088 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.1+ MB

In [14]:
users.shape

(48943, 3)

In [15]:
# We would need to use the data on conversion from the activity table and the data on all users of A & B groups 
#from the groups table.
# We need to join groups and activity tables as a LEFT JOIN because activity table contains only the data on 
#the customers that made some purchase.

In [32]:
groups_activity=pd.merge(groups,activity, on='uid',how='left',suffixes=['_a','_g'])

In [41]:
groups_activity.head()

       uid group     join_dt device_a   dt device_g  spent
0  1000000     B  2023-01-28        I  NaN      NaN    0.0
1  1000001     A  2023-01-27        A  NaN      NaN    0.0
2  1000002     A  2023-02-01        A  NaN      NaN    0.0
3  1000003     B  2023-01-25        I  NaN      NaN    0.0
4  1000004     A  2023-02-04        A  NaN      NaN    0.0

In [42]:
groups_activity.shape

(49082, 7)

In [34]:
#Select Rows without NaN Values in 'spent'Column to check the dataset. Tidle ~ means inverse boolean

groups_activity[~groups_activity['spent'].isna()]

           uid group     join_dt device_a          dt device_g       spent
38     1000039     B  2023-02-04        A  2023-02-04        A   36.650000
44     1000045     B  2023-01-26        I  2023-01-30        I   51.580000
69     1000071     B  2023-01-31        I  2023-02-02        I    6.710000
98     1000101     B  2023-02-02        A  2023-02-02        A   18.130000
99     1000101     B  2023-02-02        A  2023-02-05        A    5.674497
...        ...   ...         ...      ...         ...      ...         ...
48964  1049880     A  2023-01-26        I  2023-01-26        I  186.690000
48975  1049891     B  2023-01-26        A  2023-01-26        A   47.140000
48978  1049894     A  2023-01-25        I  2023-01-25        I   34.050000
49010  1049927     A  2023-01-25        A  2023-01-25        A   52.030000
49055  1049973     B  2023-01-27        A  2023-01-31        A   85.930000

[2233 rows x 7 columns]

In [35]:
# Use the DataFrame.fillna(0) method to replace NaN/None values with the 0 value in 'spent column'. 
#inplace = True , the data is modified in place, which means it will return nothing and the dataframe is now updated.

groups_activity['spent'].fillna(0,inplace=True)

In [36]:
groups_activity.head()

       uid group     join_dt device_a   dt device_g  spent
0  1000000     B  2023-01-28        I  NaN      NaN    0.0
1  1000001     A  2023-01-27        A  NaN      NaN    0.0
2  1000002     A  2023-02-01        A  NaN      NaN    0.0
3  1000003     B  2023-01-25        I  NaN      NaN    0.0
4  1000004     A  2023-02-04        A  NaN      NaN    0.0

In [39]:
#Select 'spent' column with >0 values to check the dataset

groups_activity.loc[groups_activity['spent']>0]

           uid group     join_dt device_a          dt device_g       spent
38     1000039     B  2023-02-04        A  2023-02-04        A   36.650000
44     1000045     B  2023-01-26        I  2023-01-30        I   51.580000
69     1000071     B  2023-01-31        I  2023-02-02        I    6.710000
98     1000101     B  2023-02-02        A  2023-02-02        A   18.130000
99     1000101     B  2023-02-02        A  2023-02-05        A    5.674497
...        ...   ...         ...      ...         ...      ...         ...
48964  1049880     A  2023-01-26        I  2023-01-26        I  186.690000
48975  1049891     B  2023-01-26        A  2023-01-26        A   47.140000
48978  1049894     A  2023-01-25        I  2023-01-25        I   34.050000
49010  1049927     A  2023-01-25        A  2023-01-25        A   52.030000
49055  1049973     B  2023-01-27        A  2023-01-31        A   85.930000

[2233 rows x 7 columns]

In [40]:
groups_activity.shape

(49082, 7)

In [52]:
# Check if there are users that have been purchases multiple times. 

uid_counts = groups_activity['uid'].value_counts(ascending=False)
multi_uid = uid_counts[uid_counts > 1].count()

print(f'There are {multi_uid} users that have been tested more than once in the dataset.')

There are 139 users that have been tested more than once in the dataset.

In [50]:
uid_counts = groups_activity['uid'].value_counts(ascending=False)

In [51]:
print(uid_counts)

1040722    2
1044360    2
1010867    2
1027442    2
1007218    2
          ..
1016679    1
1016680    1
1016681    1
1016682    1
1049999    1
Name: uid, Length: 48943, dtype: int64

In [53]:
print(multi_uid)

139

In [62]:
#We will delete the users that have been counted more than once

uid_to_delete = uid_counts[uid_counts > 1].index

In [63]:
print(uid_to_delete)

Int64Index([1040722, 1044360, 1010867, 1027442, 1007218, 1023317, 1000101,
            1038396, 1020140, 1047318,
            ...
            1001855, 1024144, 1016208, 1005242, 1047670, 1048763, 1046864,
            1006156, 1021115, 1016124],
           dtype='int64', length=139)

In [64]:
groups_activity=groups_activity[~groups_activity['uid'].isin(uid_to_delete)]

In [65]:
print(groups_activity)

           uid group     join_dt device_a   dt device_g  spent
0      1000000     B  2023-01-28        I  NaN      NaN    0.0
1      1000001     A  2023-01-27        A  NaN      NaN    0.0
2      1000002     A  2023-02-01        A  NaN      NaN    0.0
3      1000003     B  2023-01-25        I  NaN      NaN    0.0
4      1000004     A  2023-02-04        A  NaN      NaN    0.0
...        ...   ...         ...      ...  ...      ...    ...
49077  1049995     B  2023-02-03        A  NaN      NaN    0.0
49078  1049996     A  2023-01-29        A  NaN      NaN    0.0
49079  1049997     B  2023-02-03        A  NaN      NaN    0.0
49080  1049998     B  2023-02-03        I  NaN      NaN    0.0
49081  1049999     B  2023-01-29        I  NaN      NaN    0.0

[48804 rows x 7 columns]

In [86]:
print(f'The cleaned dataset now has {groups_activity.shape[0]} rows')

The cleaned dataset now has 48804 rows

In [77]:
# 1.AB testing if there is a difference in the average amount spent per user between the two groups
# we calculate summary statistics:
# 1) The average amount spent per user for the control and treatment groups
# 2) The sample size for both groups
# 3) Calculate standard deviation of sample mean for both groups
# 5) t-statistics, p-value and conclusion

### 4) the 95% confidence interval for the average amount spent per user in the control and treatment groups
# 5) t-statistics, p-value and conclusion

In [88]:
# 1) The average amount spent per user for the control and treatment groups

x_bar=groups_activity.groupby(['group'])['spent'].mean()

In [89]:
print(x_bar)

group
A    3.078020
B    3.059325
Name: spent, dtype: float64

In [79]:
# 2) The sample size for both groups

n=groups_activity.groupby('group')['uid'].nunique()

In [80]:
print(n)

group
A    24284
B    24520
Name: uid, dtype: int64

In [84]:
# 3) Calculate standard deviation of sample mean for both groups
#ddof=1 provides an unbiased estimator of the variance of the infinite population. ddof=0 provides 
#a maximum likelihood estimate of the variance for normally distributed variables.

std_dev=groups_activity.groupby('group')['spent'].agg(np.std,ddof=0)

In [138]:
print(std_dev)

group
A    24.638716
B    24.055442
Name: spent, dtype: float64

In [ ]:
# calculate the t-statistic and p-value
t_stat, p_value = stats.ttest_ind(groupB, groupA, equal_var=False)

In [95]:
print(CI_lower_bound)

group
A    2.768126
B    2.758226
dtype: float64

In [97]:
print(CI_upper_bound)

group
A    3.387915
B    3.360424
dtype: float64

In [134]:
# Make a summary table

AB1_sample_statistics=pd.concat([x_bar,std_dev,n],axis=1)

In [ ]:
# 4) the 95% confidence interval for the average amount spent per user in the control and treatment groups

CI_lower_bound=x_bar-1.96*std_dev/np.sqrt(n)
CI_upper_bound=x_bar+1.96*std_dev/np.sqrt(n

In [135]:
print(AB1_sample_statistics)

          spent      spent    uid
group
A      3.078020  24.638716  24284
B      3.059325  24.055442  24520

In [136]:
# Rename column names in AB1_sample_statistics

AB1_sample_statistics.rename(columns={'spent': 'x_bar', 'spent': 'std_dev','uid': 'total_uid'}, inplace=True)

In [137]:
print(AB1_sample_statistics)

        std_dev    std_dev  total_uid
group
A      3.078020  24.638716      24284
B      3.059325  24.055442      24520

In [ ]:
# 5) Confidence interval (CI) for mean, the average amount spent by user – for Control group A and B separately.
#As such, we will use t-distribution, a one-sample t-interval for means.

In [110]:
# To calculate CI we need to calculate the t-value for the alpha 0.05 level of significance and 
# degrees of freedom (df) for A and B

In [111]:
df_A = n['A']-1

In [113]:
df_B = n['B']-1

In [114]:
print(df_A)

24283

In [115]:
print(df_B)

24519

In [116]:
#We can use the stats.t.ppf() function to calculate the t-value:
alpha = 0.05 # desired level of significance

tA = stats.t.ppf(alpha/2, df_A) # t-value for group A
tB = stats.t.ppf(alpha/2, df_B) # t-value for group B

In [117]:
print(tA)

-1.9600616820019887

In [118]:
print(tB)

-1.960060741599857

In [ ]:
#Calculate the CI for each group. We can use the formula for the confidence interval

In [ ]:
ciA = [xA - tA * sA / np.sqrt(nA), xA + tA * sA / np.sqrt(nA)] # CI for group A
ciB = [xB - tB * sB / np.sqrt(nB), xB + tB * sB / np.sqrt(nB)] # CI for group B